<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\AboutUsStaticContent;

class AboutUsStaticContentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        AboutUsStaticContent::create([
            'small_top_title' => 'من نحن',
            'main_top_title' => 'خبرة موثوقة',
            'about_top_title' => 'حقك ثمين... وتقييمنا ينصفك',
            'about_first_title' => 'تعرف على $$فريقنا$$ الخبير ذو الخبرة لتقديم أفضل الحلول العقارية',
            'about_first_description' => 'تفخر شركة صالح علي الغفيص للتقييم العقاري بفروعها المرخصة في مزاولة مهنة التقييم العقاري في كل من الرياض والقصيم ، حيث سعينا منذ وقت مبكر على التواصل مع الهيئة السعودية للمقيمين المعتمدين ايماناً منا بأهمية مهنة التقييم وتطويرها وتنظيمها ليكون العمل بالمهنة وفق األنظمة والمعايير الدولية للتقييم',
            'about_second_title' => 'التأسيس',
            'about_second_description' => 'تأسست شركة صالح علي الغفيص للتقييم والتثمين العقاري سنة 2015م بمنطقة القصيم بمدينة بريدة ويحمل سجل تجاري رقم )1131056566( ، ثم التوسع ليتم افتتاح مكتب الرياض سنة 2021م بسجل تجاري رقم )1010721458( وتغطي أعمال الشركة كافة مناطق المملكة .',
            'management_title' => 'الإدارة',
            'management_description' => 'يدير الشركة رئيس مجلس اإلدارة / صالح علي الغفيص ، والذي يعمل في مجال التقييم العقاري منذ أكثر من 24 سنة ، وله العديد من المناصب والمؤهالت كالتالي :',
            'feat1_title' => 'تنمية.. وتطوير',
            'feat1_description' => 'المساهمة في تنمية الوطن، وتحقيق رؤية المملكة 2030م، والمشاركة في تطوير السوق العقارية.',
            'feat2_title' => 'تدريب.. وتأهيل',
            'feat2_description' => 'رفع كفاءة الشباب السعودي وتأهيلهم في المجال العقاري.',
            'feat3_title' => 'خدمات متكاملة',
            'feat3_description' => 'تقديم خدمات التقييم المتكاملة لعقارات الأفراد والشركات.',
            'values_title' => 'قيمنا',
            'vision_title' => 'رؤيتنا',
            'vision_description' => 'نتطلع الن نكون من أهم الرواد في مجال التقييم والدراسات العقارية وتقديم االستشارات العقارية بما يتناسب مع تطلعات عمالئنا',
            'message_title' => '$$رسالتنا$$',
            'message_description' => 'مساعدة عمالئنا في تقييم عقارتهم وتقديم االستشارات والدراسات المطلوبة بمهنية عالية وفقاً لمعايير التقييم الدولية',
            'reports_title' => 'تقارير و تقييمات $$السوق العقاري$$ معلومات مفصلة لمساعدتك في اتخاذ قرارات ذكية',
        ]);
    }
}
