import React from "react";
import BlogIcon from "../../../blog/BlogIcon";
import { Button, ParagraphContent } from "../../../../components";
import { useNavigate } from "react-router-dom";

const ArticleBoxDetails = ({ currentBlog }) => {
	const navigate = useNavigate();
	return (
		<div className='2xl:w-[820px] xl:w-[793px] lg:w-[650px] w-[360px] xl:h-[1413px] lg:h-auto h-auto rounded-tl-[100px] rounded-br-[100px] border border-primary-600 bg-bg-01 py-[34px] px-[32px] md:mb-0 mb-[50px]'>
			<div className='xl:w-[722px] lg:w-full w-full flex flex-col items-start gap-8'>
				<div className='flex flex-col items-start gap-[14px] self-stretch'>
					<BlogIcon color={"#0F819F"} width='34px' height='34px' />
					<ParagraphContent>
						تخيل أنك تفكر في شراء منزل أحلامك، وتعتمد بشكل كبير على تقرير
						التقييم العقاري لتحديد القيمة العادلة للعقار. لكن، هل هذا التقرير
						دقيق وموضوعي حقًا؟ هل أنت على يقين من أنك تحصل على قيمة عادلة مقابل
						أموالك؟ هذا هو جوهر قضية الشفافية في التقييم العقاري، وهي قضية تهم
						كل من يفكر في شراء أو بيع عقار.
					</ParagraphContent>
				</div>
				<Button
					className={
						"xl:w-[364px] lg:w-[320px] w-full sm:h-[48px] lg:h-[46px] xl:h-[48px] py-[15px] px-[80px "
					}>
					احصل على خصم 30%
				</Button>

				<h3 className=' head-line-h5 text-right text-Black-01'>
					لماذا تحتاج إلى تقييم عقاري شفاف؟
				</h3>

				<ParagraphContent>
					الحماية من الغش والتلاعب التقييم العقاري الشفاف هو خط الدفاع الأول ضد
					الغش والتلاعب. التقييم غير الشفاف يمكن أن يؤدي إلى تقديم معلومات مضللة
					سواء للمشتري أو البائع، مما قد يتسبب في اتخاذ قرارات مالية غير مبررة.
					في عالم العقارات، حيث القيم يمكن أن تكون متغيرة ومعقدة، يمكن للتقييم
					غير الدقيق أن يخفي عيوباً أو يبالغ في قيمة العقار، مما يضر بمصالح
					الأطراف المعنية.
					<br />
					<br />
					اتخاذ قرارات استثمارية صائبة تقييم العقار بدقة وشفافية هو الأساس
					لاتخاذ قرارات استثمارية مدروسة. عندما يكون لديك تقييم دقيق وموضوعي،
					يمكنك تحديد القيمة الحقيقية للعقار وفهم العائد المحتمل على استثمارك.
					التقييم غير الشفاف يمكن أن يؤدي إلى تداعيات مالية غير متوقعة، مثل دفع
					مبالغ زائدة أو بيع عقار بأقل من قيمته الحقيقية. لذا، التقييم الشفاف هو
					أداة ضرورية لتحقيق استثمار ناجح ومستدام.
					<br />
					<br />
					احد من النزاعات القانونية الشفافية في التقييم العقاري تقلل بشكل كبير
					من احتمالية نشوء النزاعات القانونية. عندما يتم إجراء تقييم بدقة
					وموضوعية، يكون لديك تقرير واضح يمكن أن يكون بمثابة دليل قوي في حال
					حدوث أي نزاع حول قيمة العقار. التقييم الشفاف يساهم في تسوية أي خلافات
					محتملة بطرق أكثر سلاسة، ويعزز الثقة بين الأطراف المتعاملين.
				</ParagraphContent>

				<Button
					onClick={() => navigate("/request-evaluation")}
					className={
						"md:w-[364px] w-full  sm:h-[48px] lg:h-[46px] xl:h-[48px] py-[15px] px-[80px "
					}>
					اطلب تقييمك من خبير
				</Button>

				<h3 className='head-line-h5 text-right text-Black-01'>
					كيف تعرف أن التقييم العقاري الذي حصلت عليه شفاف؟
				</h3>

				<ParagraphContent>
					الأسئلة التي يجب طرحها على المقيم العقاري
					<br />
					لضمان شفافية التقييم، من المهم طرح الأسئلة التالية على المقيم العقاري:
					<br />
					1. ما هي المعايير والأسس التي استخدمتها في تقييم العقار؟
					<br />
					2. هل قمت بزيارة العقار شخصياً أم اعتمدت على معلومات من مصادر أخرى؟
					<br />
					3. كيف تم احتساب القيمة السوقية للعقار؟ هل استخدمت مقارنة مع عقارات
					مشابهة؟
					<br />
					4. هل يمكنك توفير تقرير تفصيلي يوضح جميع العوامل التي أثرت على
					التقييم؟
					<br />
					<br />
					المؤشرات التي تدل على الشفافية
					<br />
					تتضمن بعض المؤشرات على أن التقييم يتم بطريقة شفافة وموضوعية:
					<br />
					● تقرير تفصيلي يحتوي على جميع البيانات والأسس المستخدمة في التقييم.
					<br />
					● استخدام معايير معترف بها وممارسات تقييم معيارية.
					<br />
					● تقديم تفاصيل واضحة عن كيفية مقارنة العقار مع عقارات أخرى في السوق.
					<br />● التفسير الكامل لأي تعديلات أو استثناءات تم إدخالها في التقييم.
				</ParagraphContent>
				<h3 className=' head-line-h5 text-right text-Black-01'>
					أهمية اختيار مقيم عقاري معتمد
				</h3>
				<ParagraphContent>
					اختيار مقيم عقاري معتمد هو خطوة أساسية لضمان الحصول على تقييم شفاف
					ودقيق. حيث في شركة صالح الغفيص يتمتع خبرائنا المعتمدين بمهارات ومؤهلات
					عالية تؤهلهم لتقديم تقييمات موثوقة وشفافة، مما يضمن لك أن تكون جميع
					المعلومات التي تتلقاها ذات مصداقية وموضوعية.
				</ParagraphContent>

				<Button className={"md:w-[364px] w-full py-[15px] px-[80px"}>
					اطلب عرض سعر تقييم
				</Button>
				<ParagraphContent>
					الشفافية في التقييم العقاري ليست مجرد ترف، بل هي حق أساسي لكل من
					يتعامل مع العقارات. من خلال فهم أهمية الشفافية وطرق ضمانها، يمكنك
					اتخاذ قرارات استثمارية أكثر حكمة وحماية نفسك من أي مخاطر محتملة.
				</ParagraphContent>
			</div>
		</div>
	);
};

export default ArticleBoxDetails;
