import React from "react";
import { GhafisShape, ParagraphContent, TextContent } from "../../xcomponents";
import ImageBox from "../../xcomponents/aboutSection/ImageBox";

const AboutBoxOne = () => {
    return (
        <section className="w-full relative md:mt-[12rem] mt-[6rem] md:mb-[102px] mb-[50px]">
            <div className="container ">
                <div className="flex md:flex-row flex-col md:justify-between md:gap-0 gap-4 items-start">
                    <section className="xl:w-[590px] lg:w-[490px] w-full flex flex-col items-end gap-[48px] md:mb-0 mb-[48px] self-center">
                        <TextContent headLineClass="head-line-h3">
                            تعرّف على{" "}
                            <span className="text-primary-600">فريقنا</span>{" "}
                            الخبير ذو الخبرة لتقديم أفضل الحلول العقارية
                        </TextContent>

                        <ParagraphContent>
                            تفخر شركة صالح علي الغفيص للتقييم العقاري بفروعها
                            المرخصة في مزاولة مهنة التقييم العقاري في كل من
                            الرياض والقصيم ، حيث سعينا منذ وقت مبكر على التواصل
                            مع الهيئة السعودية للمقيمين المعتمدين ايماناً منا
                            بأهمية مهنة التقييم وتطويرها وتنظيمها ليكون العمل
                            بالمهنة وفق األنظمة والمعايير الدولية للتقييم
                        </ParagraphContent>

                        <section className=" flex flex-col items-start gap-4">
                            <div className="flex items-end gap-4">
                                <span>
                                    <svg
                                        xmlns="http://www.w3.org/2000/svg"
                                        width="50"
                                        height="50"
                                        viewBox="0 0 50 50"
                                        fill="none"
                                    >
                                        <path
                                            opacity="0.952"
                                            fillRule="evenodd"
                                            clipRule="evenodd"
                                            d="M24.6563 5.22461C25.154 5.22878 25.6098 5.37526 26.0235 5.66406C28.5625 7.12891 31.1016 8.59375 33.6406 10.0586C33.8833 10.2038 34.0949 10.3829 34.2754 10.5957C34.3406 14.1765 34.3406 17.7571 34.2754 21.3379C34.1614 21.4519 34.0476 21.5657 33.9336 21.6797C31.2158 23.2175 28.514 24.78 25.8281 26.3672C25.2422 26.8229 24.6563 26.8229 24.0703 26.3672C21.3845 24.78 18.6826 23.2175 15.9649 21.6797C15.8509 21.5657 15.737 21.4519 15.6231 21.3379C15.5579 17.7571 15.5579 14.1765 15.6231 10.5957C16.0368 10.2504 16.4763 9.94121 16.9414 9.66797C19.5295 8.20018 22.1011 6.71905 24.6563 5.22461ZM24.7539 7.08008C24.9644 7.06758 25.1597 7.11641 25.3399 7.22656C27.4883 8.46354 29.6367 9.70052 31.7852 10.9375C31.8781 11.0076 31.8943 11.089 31.834 11.1816C29.5313 12.4388 27.2364 13.7083 24.9492 14.9902C22.6546 13.6966 20.376 12.3782 18.1133 11.0352C18.1784 10.97 18.2435 10.905 18.3086 10.8398C20.4792 9.60863 22.6277 8.35538 24.7539 7.08008ZM17.1367 12.4512C19.4695 13.7723 21.797 15.1069 24.1192 16.4551C24.1843 19.1243 24.1843 21.7937 24.1192 24.4629C21.8483 23.0913 19.5533 21.7566 17.2344 20.459C17.1367 17.7905 17.1042 15.1212 17.1367 12.4512ZM32.5664 12.6465C32.6966 13.9144 32.7616 15.2164 32.7617 16.5527C32.7292 17.8548 32.6966 19.1569 32.6641 20.459C30.3451 21.7566 28.0502 23.0913 25.7793 24.4629C25.698 21.7931 25.7142 19.1237 25.8281 16.4551C28.0962 15.2076 30.3423 13.9381 32.5664 12.6465Z"
                                            fill="#0F819F"
                                        />
                                        <path
                                            opacity="0.944"
                                            fillRule="evenodd"
                                            clipRule="evenodd"
                                            d="M12.8398 15.5765C13.9492 15.4993 14.2747 15.9713 13.8164 16.9925C11.5869 18.2536 9.37333 19.5395 7.17578 20.8499C13.1003 24.2679 19.0247 27.6859 24.9492 31.1038C30.9639 27.7575 36.9534 24.3721 42.918 20.9476C40.6553 19.6045 38.3767 18.2862 36.082 16.9925C35.7356 16.5813 35.7356 16.1581 36.082 15.723C36.6349 15.4991 37.1557 15.5642 37.6445 15.9183C40.07 17.3427 42.5114 18.7424 44.9688 20.1175C45.086 20.2057 45.1675 20.3196 45.2129 20.4593C45.3095 24.6342 45.2769 28.8008 45.1152 32.9593C38.5966 36.764 32.0698 40.5563 25.5352 44.3363C25.1445 44.5316 24.7539 44.5316 24.3633 44.3363C17.78 40.5484 11.2208 36.7235 4.68555 32.8616C4.62044 28.7276 4.62044 24.5934 4.68555 20.4593C4.73098 20.3196 4.81237 20.2057 4.92969 20.1175C7.60439 18.6506 10.2411 17.1369 12.8398 15.5765ZM6.19922 22.3148C12.1668 25.7058 18.1238 29.1238 24.0703 32.5687C24.1843 35.7908 24.2005 39.0135 24.1191 42.2366C18.1621 38.7862 12.2051 35.3356 6.24805 31.8851C6.19922 28.6951 6.18295 25.505 6.19922 22.3148ZM43.6016 22.5101C43.7152 25.6186 43.7315 28.7436 43.6504 31.8851C37.6934 35.3356 31.7363 38.7862 25.7793 42.2366C25.698 39.0135 25.7142 35.7908 25.8281 32.5687C31.7587 29.2131 37.6832 25.8603 43.6016 22.5101Z"
                                            fill="#0F819F"
                                        />
                                    </svg>
                                </span>
                                <h3 className="head-line-h3 text-Black-01">
                                    التأسيس
                                </h3>
                            </div>
                            <ParagraphContent>
                                تأسست شركة صالح علي الغفيص للتقييم والتثمين
                                العقاري سنة 2015م بمنطقة القصيم بمدينة بريدة
                                ويحمل سجل تجاري رقم )1131056566( ، ثم التوسع
                                ليتم افتتاح مكتب الرياض سنة 2021م بسجل تجاري رقم
                                )1010721458( وتغطي أعمال الشركة كافة مناطق
                                المملكة .
                            </ParagraphContent>
                        </section>
                    </section>
                    <ImageBox />
                </div>
            </div>

            <GhafisShape position=" xl:bottom-[2rem] bottom-[18rem]" />
        </section>
    );
};

export default AboutBoxOne;
