import {
	AboutGroup01,
	AboutGroup02,
	AboutGroup03,
} from "../assets/images/about";

export const aboutData = [
	{
		id: 1,
		img: AboutGroup01,
		title: "تنمية.. وتطوير",
		desc: "المساهمة في تنمية الوطن، وتحقيق رؤية المملكة 2030م، والمشاركة في تطوير السوق العقارية.",
	},
	{
		id: 2,
		img: AboutGroup02,
		title: "تدريب.. وتأهيل",
		desc: "رفع كفاءة الشباب السعودي وتأهيلهم في المجال العقاري.",
	},
	{
		id: 3,
		img: AboutGroup03,
		title: "خدمات متكاملة",
		desc: "تقديم خدمات التقييم المتكاملة لعقارات الأفراد والشركات.",
	},
];

export const managerHistory = [
	{
		id: 1,
		title: "نائب رئيس اللجنة العقارية بالغرفة التجارية الصناعية بالقصيم .",
	},
	{
		id: 2,
		title: "رئيس لجنة التقييم والتثمين بالغرفة التجارية بالقيم .",
	},
	{
		id: 3,
		title: "عضو زميل لدى الهيئة السعودية للمقيمين المعتمدين .",
	},
	{
		id: 4,
		title: "عضو الأكاديمية العربية في االختصاص المهني .",
	},
	{
		id: 5,
		title: "عضو المعهد الملكي البريطاني للمساحين القانونيين (RICS ).",
	},
	{
		id: 6,
		title:
			"مقيم معتمد لدى العديد من الجهات الحكومية والخاصة من المحاكم والبنوك .",
	},
];
