import { BlogImage } from "../assets/images/blog";

export const blogCategoriesData = [
	{
		id: 1,
		category: "تقييم عقاري",
		blogsCount: 13,
	},
	{
		id: 2,
		category: "دراسة الجدوى",
		blogsCount: 4,
	},
	{
		id: 3,
		category: "خبيير تقييم عقاري",
		blogsCount: 0,
	},
	{
		id: 4,
		category: "دراسة جدوى عقارية",
		blogsCount: 1,
	},
	{
		id: 5,
		category: "تقييم الاصول العقارية",
		blogsCount: 1,
	},
	{
		id: 6,
		category: "مكتب دراسة جدوى معتمد",
		blogsCount: 0,
	},
];

export const blogsData = [
	{
		id: 1,
		title: "الشفافية في التقييم العقاري حقّك ام ترف؟",
		image: BlogImage,
		date: "12-5-2023",
		category: "تقييم عقاري",
		description:
			"مقيم عقاري معتمد,تخيل أنك تفكر في شراء منزل أحلامك، وتعتمد بشكل كبير على تقرير التقييم العقاري لتحديد القيمة العادلة للعقار. لكن، هل هذا التقرير دقيق وموضوعي حقًا؟",
		author: "شيماء",
	},
	{
		id: 2,
		title: "الشفافية في التقييم العقاري حقّك ام ترف؟",
		image: BlogImage,
		date: "12-5-2023",
		category: "تقييم عقاري",
		description:
			"مقيم عقاري معتمد,تخيل أنك تفكر في شراء منزل أحلامك، وتعتمد بشكل كبير على تقرير التقييم العقاري لتحديد القيمة العادلة للعقار. لكن، هل هذا التقرير دقيق وموضوعي حقًا؟",
		author: "شيماء",
	},
	{
		id: 3,
		title: "الشفافية في التقييم العقاري حقّك ام ترف؟",
		image: BlogImage,
		date: "12-5-2023",
		category: "تقييم عقاري",
		description:
			"مقيم عقاري معتمد,تخيل أنك تفكر في شراء منزل أحلامك، وتعتمد بشكل كبير على تقرير التقييم العقاري لتحديد القيمة العادلة للعقار. لكن، هل هذا التقرير دقيق وموضوعي حقًا؟",
		author: "شيماء",
	},
	{
		id: 4,
		title: "الشفافية في التقييم العقاري حقّك ام ترف؟",
		image: BlogImage,
		date: "12-5-2023",
		category: "تقييم عقاري",
		description:
			"مقيم عقاري معتمد,تخيل أنك تفكر في شراء منزل أحلامك، وتعتمد بشكل كبير على تقرير التقييم العقاري لتحديد القيمة العادلة للعقار. لكن، هل هذا التقرير دقيق وموضوعي حقًا؟",
		author: "شيماء",
	},
	{
		id: 5,
		title: "الشفافية في التقييم العقاري حقّك ام ترف؟",
		image: BlogImage,
		date: "12-5-2023",
		category: "تقييم عقاري",
		description:
			"مقيم عقاري معتمد,تخيل أنك تفكر في شراء منزل أحلامك، وتعتمد بشكل كبير على تقرير التقييم العقاري لتحديد القيمة العادلة للعقار. لكن، هل هذا التقرير دقيق وموضوعي حقًا؟",
		author: "شيماء",
	},
	{
		id: 6,
		title: "الشفافية في التقييم العقاري حقّك ام ترف؟",
		image: BlogImage,
		date: "12-5-2023",
		category: "تقييم عقاري",
		description:
			"مقيم عقاري معتمد,تخيل أنك تفكر في شراء منزل أحلامك، وتعتمد بشكل كبير على تقرير التقييم العقاري لتحديد القيمة العادلة للعقار. لكن، هل هذا التقرير دقيق وموضوعي حقًا؟",
		author: "شيماء",
	},
];
